/*
 * @Description: 常用正则表达式合集
 */
const patterns = {
	"mobile": /^1[3|4|5|7|8|9]\d{9}$/, //手机号码
	"telephone": /^(\d{3,4}-)?\d{7,8}$/, //固定电话
	"phone": /^(1[3|4|5|7|8]\d{9})|((\d{3,4}-)?\d{7,8})$/, //电话号码(包括手机号码和固定电话)
	"idCard": /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/, //身份证号码
	"email": /^[A-Za-z0-9._%-]+@([A-Za-z0-9-]+\.)+[A-Za-z]{2,4}$/, //邮箱
	"postCode": /^\d{6}$/, //邮编(6位数字)
	"username": /^[0-9a-zA-Z_]{4,30}$/,	//包含字母、数字和下划线，长度为4-30个字符
	"password": /^[a-zA-Z]\w{5,17}$/, //长度6~18, 以字母开头，只能包含字母、数字和下划线
	"password2": /^(?=.*\d)(?=.*[A-z]).{6,18}$/, //长度6~18, 必须包含字母、数字
	"qq": /^[1-9][0-9]{4,10}$/, //5至11位数字,不以0开头
	"weixin": /^[A-z]([-_A-z0-9]{5,19})+$/, //6至20位字符,以字母开头,(只能包含字母、数字、减号、下划线)
	"ip": /^(\d+\.){3}\d+$/, //ip地址
	"url": /^(http|ftp|https):\/\/[a-zA-Z0-9]+\.[a-zA-Z0-9]+[\/=\?%\-&_~`@[\]\':+!]*([^<>\"\"])*$/, //url地址
	"date": /^(\d{1,4})(-|\/)(\d{1,2})\2(\d{1,2})$/, //日期格式(YYYY-MM-DD或YYYY/MM/DD)
	"dateTime": /^(\d{1,4})(-|\/)(\d{1,2})\2(\d{1,2}) (\d{1,2}):(\d{1,2}):(\d{1,2})$/, //日期格式(YYYY-MM-DD hh:mm:ss或YYYY/MM/DD hh:mm:ss)
	"enString": /^[A-z]+$/, //英文字符串
	"cnString": /^[\u0391-\uFFE5]+$/, //中文字符串
	"cnExclude": /^[^\u4e00-\u9fa5]+$/, //不包含中文字符
	"html": /<("[^"]*"|'[^']*'|[^'">])*>/, //html标记
	"number": /^[-+]?\d+(\.\d+)?$/, //数字(包括整数和小数)
	"integer": /^[-+]?\d+$/, //整数(包括正整数和负整数)
	"float": /^[-+]?\d+\.\d{2}$/, //浮点数(包含2位小数)
}

export default patterns